(load "helpers/assert.scm")

(define (A x y)
  (cond ((= y 0) 0)
    ((= x 0) (* 2 y))
    ((= y 1) 2)
    (else (A (- x 1) (A x (- y 1))))))

(assert (A 1 10) 1024)
; 2^10

(assert (A 2 4) 65536)
; 2 ↑↑ 4

(assert (A 3 3) 65536)
; 2 ↑↑ 4

;;;;; 규칙에 관해

; A(0, y) = 2y
; A(x, 0) = 0
; A(x, 1) = 2

; x가 1일 때에는 거듭 제곱
; y : A(1, y)
; 1 : 2
; 2 : A(0, A(1, 1)) = 4
; 3 : 8
; 4 : 16
; 즉, A(1, y)는 2^y

; x가 2일 때에는 테트레이션
; A(2, y)
; = A(1, A(2, y-1)) 
; = 2^A(2, y-1)
; = 2 ↑↑ y
; y : A(2, y)
; 1 : A(2, 1) = 2
; 2 : A(1, A(2, 1)) = 2^2 = 4
; 3 : A(1, A(2, 2)) = 2^(2^2) = 2 ↑↑ 3 = 16

; x가 3일 때에는 
; A(3, y)
; = A(2, A(3, y-1))
; = 2 ↑↑ A(3, y-1)
; y : A(3, y)
; 1 : A(3, 1) = 2
; 2 : A(3, 2) = A(2, A(3, 1)) = 4
; 3 : A(3, 3) = A(2, A(3, 2)) = 2 ↑↑ 4 = 2^(2^(2^2)) = 65536

(define (f n) (A 0 n))
(define (g n) (A 1 n))
(define (h n) (A 2 n))
(define (k n) (* 5 n n))

; 따라서 아래와 같지 않나
; f는 2n
; g는 2^n
; h는 2 ↑↑ n
; k는 5 * n * n ?

